import tree

def createDataSet():
    dataSet = [["青绿", "蜷缩", "浊响" ,"清晰" ,"凹陷" ,"硬滑" ,'yes'],
               ["乌黑", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", 'yes'],
               ["乌黑", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", 'yes'],
               ["青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", 'yes'],
               ["浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", 'yes'],
               ["青绿", "稍蜷", "浊响", "清晰", "稍凹", "软粘", 'yes'],
               ["乌黑", "稍蜷", "浊响", "稍糊", "稍凹", "软粘", 'yes'],
               ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑", 'yes'],
               ["乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑", 'no'],
               ["青绿", "硬挺", "清脆", "清晰", "平坦", "软粘", 'no'],
               ["浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑", 'no'],
               ["浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘", 'no'],
               ["青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑", 'no'],
               ["浅白", "稍蜷", "沉闷", "稍糊", "凹陷", "硬滑", 'no'],
               ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "软粘", 'no'],
               ["浅白", "蜷缩", "浊响", "模糊", "平坦", "硬滑", 'no'],
               ["青绿", "蜷缩", "沉闷", "稍糊", "稍凹", "硬滑", 'no']
               ]
    testDataSet =[["乌黑", "稍蜷", "软粘", "yes"],
                  ["浅白", "稍蜷", "硬滑", "no"]
                  ]
    labels = ['色泽', '根蒂', '敲声', '纹理', '肚脐', '触感']
    return dataSet, labels, testDataSet

def createDataSet1():
    dataSet = [["青绿", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", 'yes'],
               ["乌黑", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", 'yes'],
               ["乌黑", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", 'yes'],
               ["青绿", "稍蜷", "浊响", "清晰", "稍凹", "软粘", 'yes'],
               ["乌黑", "稍蜷", "浊响", "稍糊", "稍凹", "软粘", 'yes'],
               ["青绿", "硬挺", "清脆", "清晰", "平坦", "软粘", 'no'],
               ["浅白", "稍蜷", "沉闷", "稍糊", "凹陷", "硬滑", 'no'],
               ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "软粘", 'no'],
               ["浅白", "蜷缩", "浊响", "模糊", "平坦", "硬滑", 'no'],
               ["青绿", "蜷缩", "沉闷", "稍糊", "稍凹", "硬滑", 'no']
              ]
    testDataSet = [["青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", 'yes'],
                   ["浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", 'yes'],
                   ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑", 'yes'],
                   ["乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑", 'no'],
                   ["浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑", 'no'],
                   ["浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘", 'no'],
                   ["青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑", 'no']
                  ]

    testDataSet1 = [["青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑"],
                    ["浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],
                    ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑"],
                    ["乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑"],
                    ["浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑"],
                    ["浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘"],
                    ["青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑"]
                   ]
    labels = ['色泽', '根蒂', '敲声', '纹理', '肚脐', '触感']
    return dataSet, labels, testDataSet

dataSet, labels, testDataSet = createDataSet1()

# maxGain, setIndex, gain,intrinsticValue = tree.computerMaxGain(dataSet)
# print(labels[setIndex],gain)
mytree = tree.treeGeneratePrePunning(dataSet,testDataSet,labels)
print(mytree)
# for set in testDataSet1:
#     result = tree.testData(set,labels,mytree)
#     print(result)
